alefragnani.project-manager
almenon.arepl
batisteo.vscode-django
bierner.markdown-preview-github-styles
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
cstrap.python-snippets
davidanson.vscode-markdownlint
dbankier.vscode-instant-markdown
deerawan.vscode-dash
demystifying-javascript.python-extensions-pack
donjayamanne.git-extension-pack
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
gxl.git-graph-3
hbenl.vscode-test-explorer
hediet.debug-visualizer
kaih2o.python-resource-monitor
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
mdickin.markdown-shortcuts
mechatroner.rainbow-csv
mintlify.document
ms-azuretools.vscode-containers
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vscode.theme-markdownkit
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
parthr2031.colorful-comments
pkief.material-icon-theme
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
sourcery.sourcery
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
thebarkman.vscode-djaneiro
walkme.markdown-extension-pack
yzane.markdown-pdf
yzhang.markdown-all-in-one
ziyasal.vscode-open-in-github
